/*
1.	Створити клас згідно з варіантом завдання. У головній програмі створити масив об’єктів класу та виконати тестові
    розрахункові дії з об’єктами з використанням методів класу. (30 балів)
2.	Дослідити можливість:
    - використання кількох конструкторів класу;
    - можливість розробки класу без конструктора класу.
    Дослідити можливість визначення методу з одним іменем, але різним списком аргументів.
    Дослідити механізм інкапсуляції даних. (30 балів)
3.	Дослідити поняття статичного поля класу.
    Створити статичне поле для класу. (20 балів)
4.	Дослідити поняття статичного методу класу.
    Створити статичний метод та надати приклад
    його використання в головній програмі. (20 балів)
*/

package Lab1;

public class Car {

}
